tutorials/incompressible/pisoFoam/laminar/porousBlockage/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-2 -2 -0.1)
    (6  -2 -0.1)
    (6   2 -0.1)
    (-2  2 -0.1)
    (-2 -2  0.1)
    (6  -2  0.1)
    (6   2  0.1)
    (-2  2  0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (64 32 1) simpleGrading (1 1 1)
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (2 6 5 1)
        );
    }

    top
    {
        type symmetryPlane;
        faces
        (
            (3 7 6 2)
        );
    }

    bottom
    {
        type symmetryPlane;
        faces
        (

            (1 5 4 0)
        );
    }

    frontAndBack
    {
        type empty;
        faces
        (
            (0 3 2 1)
            (4 5 6 7)
        );
    }
);

// ************************************************************************* //
